# ----------------ГРАЮСЯ З ПРІНТАМИ-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
print("Hello World") 
"""

print("Number:", 7 + 13 * 10 / 3) # print("Number: 7") # Однакове

print("Number:", 7, 15, 5, sep="/") # sep="" дозволяє нам міняти символ між виводами (без цього атрибута будуть просто пробіли)

print("Special characters in output \"") # ми можемо поставити символ  перед наприклад лапками і воно не буде рахуватись як системне. просто як символ


# ----------------ЗМІННІ-----------------------------------------------------------------------------------------------------------------------------------------------------------------------

number = 17 # int
digitnumber = 45.68588 # float
word = "its word :)" # string
bool = True # False or True # bool
print(number, digitnumber, word, sep=", ")
number = 8
print(number)
del number, digitnumber, word # видалення змінної
# print(number, digitnumber, word, sep=", ") # і все. видає помилку тому що у нас вже немає змінної

# ----------------ВВЕДЕННЯ ДАНИХ-----------------------------------------------------------------------------------------------------------------------------------------------------------------------

number1 = input("Введіть перше число: ")
number2 = input("Введіть друге число: ")
print(number1 + number2) #якщо зробити так. то вивід буде просто два числа 5236. ВВід користувача це по базі тип string. Тому компілятор просто поставить їх поруч.

number1 = int(input("Введіть перше число: "))
number2 = int(input("Введіть друге число: "))
print(number1 + number2) # оскільки ми уточнили що тип буде Int то компілятор додав два числа
del number1, number2

# ----------------УМОВИ (IF) ТАБУЛЯЦІЯ НАШЕ ВСЕ-----------------------------------------------------------------------------------------------------------------------------------------------------------------------

                    # if a = b:
                    #   print("Yes")
                    #   if a > b:
                    #       print("a > b")

# створимо змінну типу bool
isHappy = False

if isHappy == True:
    print("user happy")
#elif number == 5: 
else:
    print("user is not happy")

# Ми можемо зробити так замість написання умови if:
data = input("Введіть число буквами: ")
number = 5 if data == "five" else 000 # якщо користувач введе five то значення змінної буде 5, інакше - 0
print(number)

# ----------------ЦИКЛИ FOR & WHILE-----------------------------------------------------------------------------------------------------------------------------------------------------------------------

for i in range(1, 6, 2): # в радіусі від 1 до 6 з кроком в 2
    print(i)

word = "Hello World!"
countOfLetters = 0
letter = input("Впишіть літеру яку ми будемо шукати у Hello World! ")
for i in word:
    if i == letter:
        countOfLetters += 1
print("Count: ", countOfLetters)

i = 5
while i < 15:
    print(i)
    i +=1
    if i == 10:
        break # коли ми досягли умови ми можемо прописати break, і він закінчить цикл

found = None # це також змінна типу bool, але якщо ми не хочемо в неї щось вносити ми можемо написати None
for i in "Hello World":
    if i == "l":
        found = True
        break       # Ми перериваємо цикл якщо вже знайшли букву
    else:
        found = False
print(found)

# ----------------CПИСКИ-----------------------------------------------------------------------------------------------------------------------------------------------------------------------

# Cписок це те ж саме що і змінна, але з більшою кількістю елементів
numbers = [5, 7, 8, 3, "Hello", True, 3.14, [1, 2, 3, 4]] # В пайтоні ми можемо в один список кидати дані різних типів, навіть самі списки
numbers[0] = 50
numbers[5] = 1 # ми можемо так навіть змінювати типи даних. Був bool а ми змінили його на int
print(numbers) # Вивід зараз такий: [50, 7, 8, 3, "Hello", 1, 3.14]
print(numbers[4]) #Можна вивести конкретний елемент за його індексом

numbers.count(1) # рахує кількість обєктів 1 у списку
numbers.append(100) # додаємо один елемент - 100 в кінці списку
numbers.insert(1, "NewNumber") # вставить на індекс 1 "NewNumber", а всі інші елементи посуне вправо
numbers.extend([1, 2]) # вставляємо те шо в дужках в кінець списку
numbers.reverse() #розвертає елементи у списку
numbers.pop() # видаляє останній елемент
numbers.remove(3) # видаляє елемент за значенням
numbers.clear() # очищає абсолютно весь список

# Вивід списка через цикл:
nums = [1, 2, 3, 8, "50", True]

for i in nums:
    i *= 2
    print(i)

numofelements = int(input("Введіть кількість елементів у списку: "))

userlist = []

i = 0
while i < numofelements:
    string = "Введіть елемент №" + str(i + 1) + ":"
    userlist.append(input(string))
    i += 1

print(userlist)
"""
# ----------------РЯДКИ-----------------------------------------------------------------------------------------------------------------------------------------------------------------------

word = "hello world!"

print(word[1]) # Виводить елемент по його індексу у рядку
print(len(word)) # Виводить кількість симовлів в рядку
# Коли ми працюємо з рядками ми можемо використовувати всі ті ж функції що і з списками (рядок 85+)

# А також є функції тільки для рядків:
print(word.upper()) # Записує рядок капс локом
print(word.capitalize()) # Робить тільки першу букву великою
print(word.find("w")) # Передасть індекс шуканого символу

splitword = "honda, toyota, ford, nissan"
print(splitword.split(",")) # Важливий метод. він розділить рядок по символу який ми передали в дужках і зробить з рядку список.
# Вивід: ['honda', ' toyota', ' ford', ' nissan']



