# 1. Вивести "Hello, Python!"
print("Hello, Python!")

# 2. Створити дві змінні та вивести їх суму
a = 5
b = 12
print(a + b)

# 3. Запитати ім’я користувача та привітати його
name  = input("Введіть ваше ім'я: ")
print("Вітаю, ", name, "!")

# 4. Запитати два числа та вивести:
# - суму
# - різницю
# - добуток
number1  = int(input("Введіть число №1: "))
number2  = int(input("Введіть число №2: "))
print("Сума: ", number1 + number2)
print("Різниця: ", number1 - number2)
print("Добуток: ", number1 * number2)

# 5. Перевірка віку:
# якщо 18+ -> "Доступ дозволено"
# інакше -> "Доступ заборонено"
age  = int(input("Введіть ваш вік: "))
if age >= 18:
    print("Доступ дозволено")
else:
    print("Доступ заборонено")

# 6. Перевірка числа:
# додатнє чи від'ємне

num  = int(input("Введіть число: "))
if num > 0:
    print("Число > 0")
elif num < 0:
    print("Число < 0")
else:
    print("Число = 0")

# 7. Через for вивести числа від 1 до 10
for i in range (0, 10):
    print(i)
    i += 1

# 8. Через while вивести числа від 10 до 1
j = 10
while j >= 1:
    print(j)
    j -= 1

# 9. Порахувати кількість букв "a" у слові "banana"
CountOfLetters = 0
for i in "banana":
    if i == a:
        CountOfLetters +=1
print("Count:", CountOfLetters)


# 10. Створити список з 5 елементів:
# - вивести весь список
# - перший елемент
# - останній елемент

# 11. Додати елемент у список через append()

# 12. Через цикл вивести всі елементи списку, помножені на 2

# 13. Дати користувачу ввести 5 елементів у список

# 14. Перевірити чи є число 7 у списку

# 15. Запитувати пароль, поки користувач не введе 1234